#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-aCZfA8Ci6Rwc8VJD

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
module.f2_instance.aws_security_group_rule.allow_ephemeral_https_return: Refreshing state... [id=sgrule-1816880000]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
module.f2_instance.aws_security_group_rule.allow_ephemeral_ssh_return: Refreshing state... [id=sgrule-3446204936]
module.f2_instance.aws_security_group_rule.allow_ephemeral_outbound_http_return: Refreshing state... [id=sgrule-1200704623]
module.f2_instance.aws_security_group_rule.allow_ephemeral_outbound_https_return: Refreshing state... [id=sgrule-1440607223]
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
module.f2_instance.aws_iam_role.this: Refreshing state... [id=main-role]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
module.f2_instance.aws_iam_instance_profile.this: Refreshing state... [id=main-instance-profile]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
module.f2_instance.aws_security_group.inbound_https: Refreshing state... [id=sg-0621a16d0eddbf3aa]
module.f2_instance.aws_security_group.inbound_ssh: Refreshing state... [id=sg-056ae0eaf09203a7f]
module.f2_instance.aws_security_group.outbound_http: Refreshing state... [id=sg-08ab2853d99b83746]
module.f2_instance.aws_security_group.outbound_https: Refreshing state... [id=sg-047a29efa80fda9f1]
module.f2_instance.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-711531578]
module.f2_instance.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1662379200]
module.f2_instance.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-1962337448]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.f2_instance.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-3642145387]
module.f2_instance.aws_instance.this: Refreshing state... [id=i-0bdb939a052debb4b]
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
module.f2_instance.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/main-policy]
module.f2_instance.aws_iam_role_policy_attachment.this: Refreshing state... [id=main-role-20230829053104189100000001]
module.f2_instance.aws_eip.this: Refreshing state... [id=eipalloc-0e2eced5b3f96fdd0]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.f2_instance.aws_instance.this will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0bdb939a052debb4b"
        tags                                 = {}
      ~ vpc_security_group_ids               = [
          - "sg-047a29efa80fda9f1",
          - "sg-056ae0eaf09203a7f",
          - "sg-0621a16d0eddbf3aa",
          - "sg-08ab2853d99b83746",
        ] -> (known after apply)
        # (32 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.f2_instance.aws_security_group.outbound_postgres will be created
  + resource "aws_security_group" "outbound_postgres" {
      + arn                    = (known after apply)
      + description            = "Allow outbound Postgres traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-outbound-postgres"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0d1ab7c53aec22955"
    }

  # module.f2_instance.aws_security_group_rule.allow_ephemeral_https_return will be destroyed
  - resource "aws_security_group_rule" "allow_ephemeral_https_return" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow ephemeral HTTPS traffic return" -> null
      - from_port              = 1024 -> null
      - id                     = "sgrule-1816880000" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0621a16d0eddbf3aa" -> null
      - security_group_rule_id = "sgr-0b89ee1b0a8226d17" -> null
      - self                   = false -> null
      - to_port                = 65535 -> null
      - type                   = "egress" -> null
    }

  # module.f2_instance.aws_security_group_rule.allow_ephemeral_outbound_http_return will be destroyed
  - resource "aws_security_group_rule" "allow_ephemeral_outbound_http_return" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow ephemeral outbound HTTP traffic return" -> null
      - from_port              = 1024 -> null
      - id                     = "sgrule-1200704623" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-08ab2853d99b83746" -> null
      - security_group_rule_id = "sgr-0edb253ae5d503986" -> null
      - self                   = false -> null
      - to_port                = 65535 -> null
      - type                   = "ingress" -> null
    }

  # module.f2_instance.aws_security_group_rule.allow_ephemeral_outbound_https_return will be destroyed
  - resource "aws_security_group_rule" "allow_ephemeral_outbound_https_return" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow ephemeral outbound HTTPS traffic return" -> null
      - from_port              = 1024 -> null
      - id                     = "sgrule-1440607223" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-047a29efa80fda9f1" -> null
      - security_group_rule_id = "sgr-079aaddf74bab8028" -> null
      - self                   = false -> null
      - to_port                = 65535 -> null
      - type                   = "ingress" -> null
    }

  # module.f2_instance.aws_security_group_rule.allow_ephemeral_ssh_return will be destroyed
  - resource "aws_security_group_rule" "allow_ephemeral_ssh_return" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow ephemeral SSH traffic return" -> null
      - from_port              = 1024 -> null
      - id                     = "sgrule-3446204936" -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-056ae0eaf09203a7f" -> null
      - security_group_rule_id = "sgr-070521dfeb40a92af" -> null
      - self                   = false -> null
      - to_port                = 65535 -> null
      - type                   = "egress" -> null
    }

  # module.f2_instance.aws_security_group_rule.allow_outbound_postgres will be created
  + resource "aws_security_group_rule" "allow_outbound_postgres" {
      + cidr_blocks              = [
          + "64.227.33.121/32",
        ]
      + description              = "Allow outbound Postgres to the Digital Ocean instance"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

Plan: 2 to add, 1 to change, 4 to destroy.

```

</details>